function 3D8N2G_Elem_Stiffness_Matrix(C,Node_coord_elem)
% 三维八节点六面体单元，二阶高斯积分的单元刚度矩阵计算程序
% 输入C为材料切线矩阵，Node_coord_elem为节点坐标，每一行为一个xyz坐标，一共八行
D=C;
x1=Node_coord_elem(1,1);y1=Node_coord_elem(1,2);z1=Node_coord_elem(1,3);
x2=Node_coord_elem(2,1);y2=Node_coord_elem(2,2);z2=Node_coord_elem(2,3);
x3=Node_coord_elem(3,1);y3=Node_coord_elem(3,2);z3=Node_coord_elem(3,3);
x4=Node_coord_elem(4,1);y4=Node_coord_elem(4,2);z4=Node_coord_elem(4,3);
x5=Node_coord_elem(5,1);y5=Node_coord_elem(5,2);z5=Node_coord_elem(5,3);
x6=Node_coord_elem(6,1);y6=Node_coord_elem(6,2);z6=Node_coord_elem(6,3);
x7=Node_coord_elem(7,1);y7=Node_coord_elem(7,2);z7=Node_coord_elem(7,3);
x8=Node_coord_elem(8,1);y8=Node_coord_elem(8,2);z8=Node_coord_elem(8,3);
J=@(s,t,n)[(x1*(n - 1)*(t - 1))/8 - (x2*(n - 1)*(t + 1))/8 + (x3*(n - 1)*(t + 1))/8 - (x4*(n - 1)*(t - 1))/8 - (x5*(n + 1)*(t - 1))/8 + (x6*(n + 1)*(t + 1))/8 - (x7*(n + 1)*(t + 1))/8 + (x8*(n + 1)*(t - 1))/8,(y1*(n - 1)*(t - 1))/8 - (y2*(n - 1)*(t + 1))/8 + (y3*(n - 1)*(t + 1))/8 - (y4*(n - 1)*(t - 1))/8 - (y5*(n + 1)*(t - 1))/8 + (y6*(n + 1)*(t + 1))/8 - (y7*(n + 1)*(t + 1))/8 + (y8*(n + 1)*(t - 1))/8,(z1*(n - 1)*(t - 1))/8 - (z2*(n - 1)*(t + 1))/8 + (z3*(n - 1)*(t + 1))/8 - (z4*(n - 1)*(t - 1))/8 - (z5*(n + 1)*(t - 1))/8 + (z6*(n + 1)*(t + 1))/8 - (z7*(n + 1)*(t + 1))/8 + (z8*(n + 1)*(t - 1))/8;
    (x1*(n - 1)*(s + 1))/8 - (x2*(n - 1)*(s + 1))/8 + (x3*(n - 1)*(s - 1))/8 - (x4*(n - 1)*(s - 1))/8 - (x5*(n + 1)*(s + 1))/8 + (x6*(n + 1)*(s + 1))/8 - (x7*(n + 1)*(s - 1))/8 + (x8*(n + 1)*(s - 1))/8,(y1*(n - 1)*(s + 1))/8 - (y2*(n - 1)*(s + 1))/8 + (y3*(n - 1)*(s - 1))/8 - (y4*(n - 1)*(s - 1))/8 - (y5*(n + 1)*(s + 1))/8 + (y6*(n + 1)*(s + 1))/8 - (y7*(n + 1)*(s - 1))/8 + (y8*(n + 1)*(s - 1))/8,(z1*(n - 1)*(s + 1))/8 - (z2*(n - 1)*(s + 1))/8 + (z3*(n - 1)*(s - 1))/8 - (z4*(n - 1)*(s - 1))/8 - (z5*(n + 1)*(s + 1))/8 + (z6*(n + 1)*(s + 1))/8 - (z7*(n + 1)*(s - 1))/8 + (z8*(n + 1)*(s - 1))/8;
    (x1*(s + 1)*(t - 1))/8 - (x2*(s + 1)*(t + 1))/8 + (x3*(s - 1)*(t + 1))/8 - (x4*(s - 1)*(t - 1))/8 - (x5*(s + 1)*(t - 1))/8 + (x6*(s + 1)*(t + 1))/8 - (x7*(s - 1)*(t + 1))/8 + (x8*(s - 1)*(t - 1))/8,(y1*(s + 1)*(t - 1))/8 - (y2*(s + 1)*(t + 1))/8 + (y3*(s - 1)*(t + 1))/8 - (y4*(s - 1)*(t - 1))/8 - (y5*(s + 1)*(t - 1))/8 + (y6*(s + 1)*(t + 1))/8 - (y7*(s - 1)*(t + 1))/8 + (y8*(s - 1)*(t - 1))/8,(z1*(s + 1)*(t - 1))/8 - (z2*(s + 1)*(t + 1))/8 + (z3*(s - 1)*(t + 1))/8 - (z4*(s - 1)*(t - 1))/8 - (z5*(s + 1)*(t - 1))/8 + (z6*(s + 1)*(t + 1))/8 - (z7*(s - 1)*(t + 1))/8 + (z8*(s - 1)*(t - 1))/8
    ];
Ndstn=@(s,t,n)[ ((n - 1)*(t - 1))/8, -((n - 1)*(t + 1))/8, ((n - 1)*(t + 1))/8, -((n - 1)*(t - 1))/8, -((n + 1)*(t - 1))/8, ((n + 1)*(t + 1))/8, -((n + 1)*(t + 1))/8, ((n + 1)*(t - 1))/8;
    ((n - 1)*(s + 1))/8, -((n - 1)*(s + 1))/8, ((n - 1)*(s - 1))/8, -((n - 1)*(s - 1))/8, -((n + 1)*(s + 1))/8, ((n + 1)*(s + 1))/8, -((n + 1)*(s - 1))/8, ((n + 1)*(s - 1))/8;
    ((s + 1)*(t - 1))/8, -((s + 1)*(t + 1))/8, ((s - 1)*(t + 1))/8, -((s - 1)*(t - 1))/8, -((s + 1)*(t - 1))/8, ((s + 1)*(t + 1))/8, -((s - 1)*(t + 1))/8, ((s - 1)*(t - 1))/8];
s1=-0.577350269189626;s2=0.577350269189626;
J111=J(s1,s1,s1);J112=J(s1,s1,s2);J121=J(s1,s2,s1);J122=J(s1,s2,s2);
J211=J(s2,s1,s1);J212=J(s2,s1,s2);J221=J(s2,s2,s1);J222=J(s2,s2,s2);
detJ111=abs(det(J111));detJ112=abs(det(J112));detJ121=abs(det(J121));detJ122=abs(det(J122));
detJ211=abs(det(J211));detJ212=abs(det(J212));detJ221=abs(det(J221));detJ222=abs(det(J222));
Nd111=inv(J111)*Ndstn(s1,s1,s1);Nd112=inv(J112)*Ndstn(s1,s1,s2);
Nd121=inv(J121)*Ndstn(s1,s2,s1);Nd122=inv(J122)*Ndstn(s1,s2,s2);
Nd211=inv(J211)*Ndstn(s2,s1,s1);Nd212=inv(J212)*Ndstn(s2,s1,s2);
Nd221=inv(J221)*Ndstn(s2,s2,s1);Nd222=inv(J222)*Ndstn(s2,s2,s2);
B111=B(Nd111);B112=B(Nd112);B121=B(Nd121);B122=B(Nd122);
B211=B(Nd211);B212=B(Nd212);B221=B(Nd221);B222=B(Nd222);
Aq=1;
Ke=B111'*D*B111*detJ111*Aq+B112'*D*B112*detJ112*Aq+B121'*D*B121*detJ121*Aq+B122'*D*B122*detJ122*Aq+B211'*D*B211*detJ211*Aq+B212'*D*B212*detJ212*Aq+B221'*D*B221*detJ221*Aq+B222'*D*B222*detJ222*Aq;

function B=B(Nd)
% 形函数
Bs=zeros(6,3,8);
for i=1:8
    Nd1=Nd(:,i);
    Bs(1,1,i)=Nd1(1);Bs(2,2,i)=Nd1(2);Bs(3,3,i)=Nd1(3);
    Bs(4,1,i)=Nd1(2);Bs(4,2,i)=Nd1(1);Bs(5,2,i)=Nd1(3);Bs(5,3,i)=Nd1(2);
    Bs(6,1,i)=Nd1(3);Bs(6,3,i)=Nd1(1);
end
B=[Bs(:,:,1),Bs(:,:,2),Bs(:,:,3),Bs(:,:,4),Bs(:,:,5),Bs(:,:,6),Bs(:,:,7),Bs(:,:,8)];
